const mathData = [
  {
    year   : 2016,
    thema  : 2,
    src    : "P",
    intro  : "Δίνεται η συνάρτηση \\[f(x) = \\frac{x^2}{x^2+1},\\quad x\\in \\mathbb{R}.\\]",
    figure : "test.svg",
    items: [
      {
        Qs  : "Να βρείτε τα διαστήματα στα οποία η $f$ είναι γνησίως αύξουσα, τα διαστήματα στα οποία η $f$ είναι γνησίως φθίνουσα και τα ακρότατα της $f$.",
        Ans : "",
        score : 6
      },
      {
        Qs  : "Να βρείτε τα διαστήματα στα οποία η $f$ είναι κυρτή, τα διαστήματα στα οποία η $f$ είναι κοίλη και να προσδιορίσετε τα σημεία καμπής της γραφικής της παράστασης.",
        Ans : "",
        score : 9
      },
      {
        Qs  : "Να βρεθούν οι ασύμπτωτες της γραφικής παράστασης της $f$.",
        Ans : "",
        score : 7
      },
      {
        Qs  : "Με βάση τις απαντήσεις σας στα προηγούμενα ερωτήματα να σχεδιάσετε τη γραφική παράσταση της συνάρτησης $f$.",
        Ans : "",
        score : 7
      }
      ]
  },
  {
    year   : 2016,
    thema  : 3,
    src    : "P",
    intro  : "",
    items: [
      {
        Qs  : "Να λύσετε την εξίσωση $e^{x^2} - x^2 - 1 = 0$, $x\\in \\mathbb{R}$.",
        Ans : "",
        score : 4
      },
      {
        Qs  : "Να βρείτε όλες τις συνεχείς συναρτήσεις $f\\colon\\mathbb{R}\\to \\mathbb{R}$ που ικανοποιούν την σχέση \\[f^2(x)= (e^{x^2} - x^2 - 1)^2\\quad \\text{για κάθε }x\\in \\mathbb{R}\\] και να αιτιολογήσετε την απάντησή σας.",
        Ans : "",
        score : 8
      },
      {
        Qs  : "Αν $f(x)= e^{x^2} - x^2 - 1$, $x\\in\\mathbb{R}$, να αποδειχθεί ότι η $f$ είναι κυρτή.",
        Ans : "",
        score : 4
      },
      {
        Qs  : "Αν $f$ είναι η συνάρτηση του τρίτου ερωτήματος, να λυθεί η εξίσωση: \\[f(\\lvert \\sin x| + 3) - f(\\lvert \\sin x|) = f(x+3)- f(x)\\] όταν $x\\in [0,+\\infty)$.",
        Ans : "",
        score : 9
      }
      ]
  },
  {
    year   : 2016,
    thema  : 4,
    src    : "P",
    intro  : "Δίνεται συνάρτηση $f$ ορισμένη και δύο φορές παραγωγίσιμη στο $\\mathbb{R}$, με συνεχή δεύτερη παράγωγο, για την οποία ισχύει ότι: \\begin{align*} &\\int_0^{\\pi}(f(x) + f''(x))\\sin x\\,dx = \\pi,\\\\  &f(\\mathbb{R}) = \\mathbb{R}, \\qquad \\lim_{x\\to 0}\\frac{f(x)}{\\sin x} = 1,\\\\ &e^{f(x)} + x = f(f(x)) + e^x\\quad\\text{για κάθε }x\\in\\mathbb{R}.\\end{align*}",
    items: [
      {
        Qs  : "Να δείξετε ότι $f(\\pi) = \\pi$ (μ. 4) και $f'(0)=1$ (μ. 3)",
        Ans : "",
        score : 7
      },
      {
        Qs  : "(i) Να δείξετε ότι η $f$ δεν παρουσιάζει ακρότατα στο $\\mathbb{R}$, (ii) Να δείξετε ότι η $f$ είναι γνησίως αύξουσα στο $\\mathbb{R}$.",
        Ans : "",
        score : 6
      },
      {
        Qs  : "Να βρείτε το \\[\\lim_{x\\to +\\infty}\\frac{\\sin x + \\cos x}{f(x)}.\\]",
        Ans : "",
        score : 6
      },
      {
        Qs  : "Να δείξετε ότι \\[0< \\int_{1}^{e^{\\pi}} \\frac{f(\\ln x)}{x}\\,dx<\\pi^2.\\]",
        Ans : "",
        score : 6
      }
      ]
  },
  {
    year   : 2017,
    thema  : 2,
    src    : "P",
    intro  : "Δίνονται οι συναρτήσεις $f(x) =\\ln x$, $x>0$ και $g(x)= \\dfrac{x}{1-x}$, $x\\neq 0$.",
    items: [
      {
        Qs  : "Να προσδιορίσετε τη συνάρτηση $f\\circ g$.",
        Ans : "",
        score : 5
      },
      {
        Qs  : "Αν \\[ h(x) = (f\\circ g)(x) =\\ln \\Bigl(\\frac{x}{1-x}\\Big),\\quad x\\in(0,1),\\] να αποδείξετε ότι η συνάρτηση $h$ αντιστρέφεται και να βρείτε την αντίστροφή της.",
        Ans : "",
        score : 6
      },
      {
        Qs  : " Αν \\[\\phi(x) = h^{-1}(x) = \\frac{e^x}{e^x+1},\\quad x\\in \\mathbb{R},\\] να μελετήσετε τη συνάρτηση $\\phi$ ως προς τη μονοτονία, τα ακρότατα, την κυρτότητα και τα σημεία καμπής.",
        Ans : "",
        score : 7
      },
      {
        Qs  : "Να βρείτε τις οριζόντιες ασύμπτωτες της γραφικής παράστασης της συνάρτησης $\\phi$ και να τη σχεδιάσετε.",
        Ans : "",
        score : 7
      }
      ]
  },
  {
    year   : 2017,
    thema  : 3,
    src    : "P",
    intro  : "Δίνεται η συνάρτηση $f(x) = -\\sin x$, $x\\in[0,\\pi]$, και το σημείο $A(\\frac{\\pi}{2},-\\frac{\\pi}{2})$.",
    items: [
      {
        Qs  : "Να αποδείξετε ότι υπάρχουν ακριβώς δύο εφαπτόμενες $(\\varepsilon_1)$, $(\\varepsilon_2)$ της γραφικής παράστασης της $f$ που άγονται από το $A$, τις οποίες και να βρείτε.",
        Ans : "",
        score : 8
      },
      {
        Qs  : "Αν $(\\varepsilon_1): y = -x$ και $(\\varepsilon_2): y=x-\\pi$ είναι οι ευθείες του ερωτήματος 1, τότε να σχεδιάσετε τις $(\\varepsilon_1)$, $(\\varepsilon_2)$ και τη γραφική παράσταση της $f$, και να αποδείξετε ότι \\[\\frac{E_1}{E_2} = \\frac{\\pi^2}{8} - 1,\\]όπου: $E_1$ είναι το εμβαδόν του χωρίου που περικλείεται από τη γραφική παράσταση της $f$ και τις ευθείες  $(\\varepsilon_1)$, $(\\varepsilon_2)$, και $E_2$ είναι το εμβαδόν του χωρίου που περικλείεται από τη γραφική παράσταση της $f$ και τον άξονα $x'x$.",
        Ans : "",
        score : 6
      },
      {
        Qs  : " Να υπολογίσετε το όριο \\[\\lim_{x\\to \\pi}\\frac{f(x) + x}{f(x) - x +\\pi}.\\]",
        Ans : "",
        score : 4
      },
      {
        Qs  : "Να αποδείξετε ότι \\[\\int_1^e\\frac{f(x)}{x}\\,dx > e -1 -\\pi.\\]",
        Ans : "",
        score : 7
      }
      ]
  },
  {
    year   : 2017,
    thema  : 4,
    src    : "P",
    intro  : "Δίνεται η συνάρτηση \\[f(x) = \\begin{cases} \\sqrt[3]{x^4},& x\\in [-1,0),\\\\ e^x\\sin x,& x\\in[0,\\pi]. \\end{cases} \\]",
    items: [
      {
        Qs  : "Να δείξετε ότι η συνάρτηση $f$ είναι συνεχής στο διάστημα $[-1,\\pi]$ και να βρείτε τα κρίσιμα σημεία της.",
        Ans : "",
        score : 5
      },
      {
        Qs  : "Να μελετήσετε τη συνάρτηση $f$ ως προς τη μονοτονία και τα ακρότατα, και να βρείτε το σύνολο τιμών της.",
        Ans : "",
        score : 6
      },
      {
        Qs  : "Να βρείτε το εμβαδόν του χωρίου που περικλείεται από τη γραφική παράσταση της $f$, τη γραφική παράσταση της $g$, με $g(x) = e^{5x}$, $x\\in \\mathbb{R}$, τον άξονα $y'y$ και την ευθεία ${x = \\pi}$.",
        Ans : "",
        score : 6
      },
      {
        Qs  : "Να λύσετε την εξίσωση $16 e^{-\\frac{3\\pi}{4}} f(x) -e^{-\\frac{3\\pi}{4}}(4x-3\\pi)^2 = 8\\sqrt{2}$.",
        Ans : "",
        score : 8
      }
    ]
  }
];

export default mathData;
